"""
PERSONA 결과 데이터
"""

PERSONA_RESULT_HOMEBODY = "꼼꼼한 집순이/집돌이"
PERSONA_RESULT_PRO_LIVING_ALONE = "똑부러지는 프로자취러"
PERSONA_RESULT_SMART = "내 맘대로 스마트하게"
PERSONA_RESULT_PLAYPLAY_DODO = "놀 땐 놀고, 할 땐 한다!"
PERSONA_RESULT_IM_FIRST = "내가 1순위"
PERSONA_RESULT_INSIDER = "집에선 잠만! 핵인싸"

PERSONA_DESCRIPTION_HOMEBODY = (
    "집에서 오래 지내는 만큼 <hr>이중 방문 구조</hr>에 거주하는 것이 현명하고, "
    "10층 이하 대로변 건물은 피해주세요!\n"
    "집순이/집돌이에게는 <hr>주변 생활 편의 시설이 중요</hr>하겠죠? "
    "자취방 500m 근처에 편의점, 마트, 병원, 공원이나 산책로가 있는지 꼭 확인해보세요!"
)
PERSONA_DESCRIPTION_PRO_LIVING_ALONE = (
    "<hr>주방과 침실 공간이 분리되어 있는 원룸</hr>은 관리와 청소도 쉽고, "
    "소음에 쉽게 노출되지 않아서 만족도 짱짱!\n"
    "발품을 많이 팔아서 <hr>역세권에 합리적인 가격의 원룸</hr>을 겟! "
    "인테리어가 별로거나 연식이 오래되었다면 직접 집을 꾸며보는 건 어떨까요?"
)
PERSONA_DESCRIPTION_SMART = (
    "마음에 쏙 드는 집을 위해 발품을 많이 팔아서 합리적인 방을 찾아야해요.\n"
    "연식은 조금 있어도 <hr>학교/직장과의 교통편이 편리한</hr> 집을 추천드려요!\n"
    "집에서 많이 생활하는만큼 <hr>환기가 잘 되고 6평(20m2) 이상</hr>이여서 "
    "침대, 옷장, 책상 등 큰 가구를 배치하고도 여유 공간이 확보되는 방이여야 해요"
)
PERSONA_DESCRIPTION_PLAYPLAY_DODO = (
    "당신의 높은 삶의 질을 위해 <hr>남향인지, 햇빛은 잘 드는지, 뷰는 어떤지</hr> 꼼꼼히 살펴보고 계약하세요!\n"
    "인싸인만큼 <hr>초역세권/더블역세권이나 버스정류장이 도보 5분 이내</hr>인 곳을 추천해요. "
    "서울 자취를 한다면 2호선 라인이 최고라구요!"
)
PERSONA_DESCRIPTION_IM_FIRST = (
    "당신의 높은 삶의 질을 위해 <hr>남향인지, 햇빛은 잘 드는지, 뷰는 어떤지</hr> 꼼꼼히 살펴보고 계약하세요!\n"
    "그리고 <hr>수납공간</hr>(수납장,붙박이장,신발장,베란다 등)이 잘 되어 있다면 "
    "집청소를 자주 하지 않아도 잘 살수 있을 거예요!"
)
PERSONA_DESCRIPTION_INSIDER = (
    "집에서 보내는 시간이 적으니 <hr>합리적인 가격대의 안락한 공간</hr>으로 방을 알아보는 것이 현명해요:)\n"
    "핵인싸인만큼 <hr>초역세권/더블역세권이나 버스정류장이 도보 5분 이내</hr>인 곳을 추천해요. "
    "서울 자취를 한다면 2호선 라인이 최고라구요!"
)
